Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--josm_overview.tmx
Source language: en
Languages: ja

source: Desktop Editor for OpenStreetMap data
ja: OpenStreetMap データのためのデスクトップ・エディタ

source: JOSM is a feature rich, extensible, offline desktop editor for OpenStreetMap (OSM) data, written in Java.
ja: JOSM は、 Java で記述された OpenStreetMap (OSM) データ用の、機能豊富で、拡張可能な、オフラインのデスクトップエディタです。

source: It supports loading stand-alone GPX tracks and GPX track data as well as editing existing nodes (points), ways (lines), metadata tags (name/value information) and relations (ordered sequence of points and lines) from the OSM database. GPX tracks, are usually downloaded in advance from a GPS receiver or from other sources.
ja: スタンドアロン GPX トラックや GPX トラックデータの読み込みと共に、OSM データベースから既存のノード (点) 、ウェイ (ライン) 、メタデータタグ (名前/値の情報) 、リレーション (点と線の順序付けられたシーケンス) の編集をサポートしています。GPX トラックは、通常、GPS 受信機または他のソースから事前にダウンロードされます。

source: A number of specialised plugins have been written for JOSM, which are available for download and install.
ja: JOSM のために記述された特殊なプラグインのいくつかは、ダウンロードしてインストールが可能です。

source: Core Features
ja: 主要機能

source: Common GIS Desktop Interface tools:
ja: 共通的なGISデスクトップインタフェースツール:

source: Tool bar customization, View control (zoom, pan. etc), styles, icons and layers management.
ja: ツールバーのカスタマイズ、Viewコントロール（ズーム、パン、など）、スタイル、アイコンとレイヤ管理。

source: Download and upload OSM vector data.
ja: OSMベクタデータのダウンロードおよびアップロード

source: Open local data:
ja: ローカルデータのオープン:

source: NMEA-0183 files: .nmea, .nme, .nma, .log, .txt
ja: NMEA-0183 ファイル: .nmea, .nme, .nma, .log, .txt

source: OSM files: .osm, .xlm, .osmbz2, .osmbz
ja: OSM ファイル: .osm, .xlm, .osmbz2, .osmbz

source: OSM change file: .osc, .osc.bz2, .osc.bz, .osc.gz
ja: OSM 変更ファイル: .osc, .osc.bz2, .osc.bz, .osc.gz

source: images (.jpg)
ja: 画像 (.jpg)

source: Imagery:
ja: 画像:

source: Visualize basemaps from OSM, Bingsat, Lansat, MapBox satellite, MapQuest Open Aerial or any other WMS sources.
ja: OSM、Bingsat、Lansat、MapBox satellite、MapQuest Open Aerial またはその他の WMS ソースをベースマップとして可視化

source: Editing Tools:
ja: 編集ツール:

source: Nodes: merge, join, unglue, distribute, align in circle, align in line, join node to way, and more.
ja: ノード: マージ、結合、引き離し、分割、円の整列、線の整列、ウェイへのノードの結合、ほか

source: Ways: split, combine, reverse, simplify, unglue ways, and more.
ja: ウェイ: 分割、結合、簡素化、ウェイの引き離し、ほか

source: Areas: join overlapping areas, create multi-polygon, and more.
ja: エリア: 重複するエリアの結合、マルチポリゴンを作成、ほか

source: Audio mapping: survey recording management.
ja: 音声マッピング: 調査記録の管理

source: Photo mapping: survey pictures management.
ja: 写真マッピング: 調査写真の管理

source: Plugins: A list of specialized plugins are available for download.
ja: プラグイン：特化したプラグインのリストをダウンロード可能

source: Implemented Standards
ja: 実装されている標準規格

source: JOSM views WMS layers, but uses the `OSM API <https://wiki.openstreetmap.org/wiki/API_v0.6>`_ to communicate with OSM database.
ja: JOSM は WMS レイヤーを閲覧し、 `OSM API <https://wiki.openstreetmap.org/wiki/API_v0.6>`_ を使用してOSMデータベースと通信します

source: Details
ja: 詳細

source: **Website:** https://josm.openstreetmap.de
ja: **Webサイト:** https://josm.openstreetmap.de

source: **Licence:** GNU General Public License (GPL) version 2. Note: JOSM plugins may use other licences.
ja: **ライセンス:** GNU General Public License (GPL) version 2注: JOSM プラグインは他のライセンスを使用しているかもしれません。

source: **Software Version:** r11427
ja: **ソフトウェアバージョン:** r11427

source: **Supported Platforms:** Windows, Linux, Mac
ja: **対応プラットフォーム:** Windows, Linux, Mac

source: **API Interfaces:** Java
ja: **API インターフェイス:** Java

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/josm_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/josm_quickstart>`
